```
» terraform apply -var-file="/home/bbrooks/terraform/bootstrap.tfvars"            bbrooks@Beast

Terraform used the selected providers to generate the following execution plan. Resource
actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.bucket-require-tls will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "bucket-require-tls"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "s3:*",
            ]
          + effect    = "Deny"
          + resources = [
              + (known after apply),
              + (known after apply),
            ]
          + sid       = "RequireTLS"

          + condition {
              + test     = "Bool"
              + values   = [
                  + "false",
                ]
              + variable = "aws:SecureTransport"
            }
          + condition {
              + test     = "NumericLessThan"
              + values   = [
                  + "1.2",
                ]
              + variable = "s3:TlsVersion"
            }

          + principals {
              + identifiers = [
                  + "666324759800",
                ]
              + type        = "AWS"
            }
        }
    }

  # aws_s3_bucket.terraform-state-bucket will be created
  + resource "aws_s3_bucket" "terraform-state-bucket" {
      + acceleration_status                  = (known after apply)
      + acl                                  = (known after apply)
      + arn                                  = (known after apply)
      + bucket                               = "terraform-state-bucket-20220211144530"
      + bucket_domain_name                   = (known after apply)
      + bucket_regional_domain_name          = (known after apply)
      + cors_rule                            = (known after apply)
      + force_destroy                        = false
      + grant                                = (known after apply)
      + hosted_zone_id                       = (known after apply)
      + id                                   = (known after apply)
      + lifecycle_rule                       = (known after apply)
      + logging                              = (known after apply)
      + policy                               = (known after apply)
      + region                               = (known after apply)
      + replication_configuration            = (known after apply)
      + request_payer                        = (known after apply)
      + server_side_encryption_configuration = (known after apply)
      + tags                                 = {
          + "Environment" = "Test"
          + "Name"        = "Terraform State Bucket"
          + "Terraform"   = "Bootstrap"
        }
      + tags_all                             = {
          + "Environment" = "Test"
          + "Name"        = "Terraform State Bucket"
          + "Terraform"   = "Bootstrap"
        }
      + versioning                           = (known after apply)
      + website                              = (known after apply)
      + website_domain                       = (known after apply)
      + website_endpoint                     = (known after apply)

      + object_lock_configuration {
          + object_lock_enabled = (known after apply)
          + rule                = (known after apply)
        }
    }

  # aws_s3_bucket_acl.terraform-state-bucket-acl will be created
  + resource "aws_s3_bucket_acl" "terraform-state-bucket-acl" {
      + acl    = "private"
      + bucket = (known after apply)
      + id     = (known after apply)

      + access_control_policy {
          + grant {
              + permission = (known after apply)

              + grantee {
                  + display_name  = (known after apply)
                  + email_address = (known after apply)
                  + id            = (known after apply)
                  + type          = (known after apply)
                  + uri           = (known after apply)
                }
            }

          + owner {
              + display_name = (known after apply)
              + id           = (known after apply)
            }
        }
    }

  # aws_s3_bucket_policy.terraform-state-bucket-require-tls will be created
  + resource "aws_s3_bucket_policy" "terraform-state-bucket-require-tls" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
    }

  # aws_s3_bucket_public_access_block.terraform-state-bucket-public-access-block will be created
  + resource "aws_s3_bucket_public_access_block" "terraform-state-bucket-public-access-block" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # aws_s3_bucket_server_side_encryption_configuration.terraform-state-bucket-sse will be created
  + resource "aws_s3_bucket_server_side_encryption_configuration" "terraform-state-bucket-sse" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + apply_server_side_encryption_by_default {
              + sse_algorithm = "AES256"
            }
        }
    }

  # aws_s3_bucket_versioning.terraform-state-bucket-versioning will be created
  + resource "aws_s3_bucket_versioning" "terraform-state-bucket-versioning" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

Plan: 6 to add, 0 to change, 0 to destroy.
```